In [1]:
import pandas as pd

In [53]:
df = pd.DataFrame({
    "name":["Jack", "Samson", "Jason", "Sally"],
    "salary": [15000,14852,25000,36045]
})
df

     name  salary
0    Jack   15000
1  Samson   14852
2   Jason   25000
3   Sally   36045

In [54]:
df["salary"] = 2*df["salary"]
df

     name  salary
0    Jack   30000
1  Samson   29704
2   Jason   50000
3   Sally   72090

In [50]:
df.columns

Index(['Employees name', 'Employess_salary'], dtype='object')

In [33]:
df.columns = ["Employees name", "Employess_salary"]

In [55]:
data = pd.DataFrame(df["salary"], dtype="float")
data

    salary
0  30000.0
1  29704.0
2  50000.0
3  72090.0

In [56]:
df["salary"] = data

In [57]:
df

     name   salary
0    Jack  30000.0
1  Samson  29704.0
2   Jason  50000.0
3   Sally  72090.0

In [50]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6]
                   })
df

   foo bar  baz
0  one   A    1
1  one   B    2
2  one   C    3
3  two   A    4
4  two   B    5
5  two   C    6

In [23]:
data = df.pivot(index="baz", columns="foo", values = ["bar"])
data

     zoo       bar
foo  one  two  one  two
baz
1      x  NaN    A  NaN
2      y  NaN    B  NaN
3      z  NaN    C  NaN
4    NaN    q  NaN    A
5    NaN    w  NaN    B
6    NaN    t  NaN    C

In [24]:
df.drop("zoo", axis=1, inplace=True)
newd = df.pivot(index='baz',columns='foo')
newd

     bar
foo  one  two
baz
1      A  NaN
2      B  NaN
3      C  NaN
4    NaN    A
5    NaN    B
6    NaN    C

In [9]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [10]:
df.columns

Index(['foo', 'bar', 'baz'], dtype='object')

In [12]:
df

   foo bar  baz
0  one   A    1
1  one   B    2
2  one   C    3
3  two   A    4
4  two   B    5
5  two   C    6

In [36]:
print(newd.columns)
newd

Index(['one', 'two'], dtype='object')

     one  two
baz
1      A  NaN
2      B  NaN
3      C  NaN
4    NaN    A
5    NaN    B
6    NaN    C

In [52]:
newd.index.names = ['sn']

In [53]:
newd

    one  two
sn
1     A  NaN
2     B  NaN
3     C  NaN
4   NaN    A
5   NaN    B
6   NaN    C

In [54]:
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'}, 
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'}, 
                   'Age': {0: 27, 1: 23, 2: 21}})

In [55]:
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [58]:
df['isgt21'] = df['Age'] > 21

In [59]:
df

     Name    Course  Age  isgt21
0    John   Masters   27    True
1     Bob  Graduate   23    True
2  Shiela  Graduate   21   False

In [71]:
df[df['Age'] > 21].drop(["Course", 'Age', 'isgt21'], axis=1)

   Name
0  John
1   Bob